bench-results/2016041801/03-etcdv2-result.log
nohup: ignoring input

2016/04/19 03:50:59 Step 1: starting databases...
2016/04/19 03:50:59 [0] Start etcdv2 at 10.240.0.7:3500
2016/04/19 03:50:59 [0] Response from 10.240.0.7:3500 (success:true )
2016/04/19 03:51:00 [1] Start etcdv2 at 10.240.0.13:3500
2016/04/19 03:51:00 [1] Response from 10.240.0.13:3500 (success:true )
2016/04/19 03:51:01 [2] Start etcdv2 at 10.240.0.14:3500
2016/04/19 03:51:01 [2] Response from 10.240.0.14:3500 (success:true )

2016/04/19 03:51:07 Step 2: starting tests...
 0 / 500000 B                                   !   0.00%2016/04/19 03:51:07 finalize has started
 500000 / 500000 Boooooooooooooooooooooooooo! 100.00% 39s

Summary:
  Total:	39.6536 secs.
  Slowest:	0.9809 secs.
  Fastest:	0.0041 secs.
  Average:	0.0725 secs.
  Stddev:	0.1228 secs.
  Requests/sec:	10741.8114

Response time histogram:
  0.004 [1]	|
  0.102 [362046]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.199 [22707]	|∎∎
  0.297 [11807]	|∎
  0.395 [12269]	|∎
  0.493 [4352]	|
  0.590 [6574]	|
  0.688 [4119]	|
  0.786 [1282]	|
  0.883 [630]	|
  0.981 [165]	|

Latency distribution:
  10% in 0.0179 secs.
  25% in 0.0216 secs.
  50% in 0.0292 secs.
  75% in 0.0427 secs.
  90% in 0.1910 secs.
  95% in 0.3456 secs.
  99% in 0.6192 secs.
unix_ts,avg_latency_ms,throughput
1461037867,45.199614,1297
1461037868,26.772844,28286
1461037869,37.789761,25628
1461037870,42.094945,23479
1461037871,39.890537,22872
1461037872,47.890425,20160
1461037873,57.383410,18842
1461037874,58.833894,15314
1461037875,67.308112,16149
1461037876,63.920553,14446
1461037877,61.152347,16136
1461037878,83.764118,11843
1461037879,64.179066,16207
1461037880,126.330220,7961
1461037881,65.990392,14819
1461037882,79.155632,10272
1461037883,95.389113,10220
1461037884,85.532615,12056
1461037885,93.944825,11631
1461037886,93.658169,11130
1461037887,270.931315,3690
1461037888,146.483513,6199
1461037889,110.693351,6123
1461037890,127.245418,9982
1461037891,95.393531,7891
1461037892,51.795811,10669
1461037893,169.208484,4955
1461037894,57.340319,6894
1461037895,452.875950,567
1461037896,98.173330,8852
1461037897,59.379907,10041
1461037898,74.962685,10303
1461037899,139.624011,5318
1461037900,65.319740,5322
1461037901,79.280678,10058
1461037902,594.720359,475
1461037903,66.829391,6130
1461037904,132.013971,2584
1461037905,315.060886,951
1461037906,894.541281,200

2016/04/19 03:51:47 time series saved... Uploading to Google cloud storage...
2016/04/19 03:51:47 Uploading timeseries.csv to 2016041801/03-etcdv2-timeseries.csv
UploadFile:

timeseries.csv
--->
2016041801/03-etcdv2-timeseries.csv


UploadFile Done!

2016/04/19 03:51:48 Uploading result.log to 2016041801/03-etcdv2-result.log
UploadFile:

result.log
--->
2016041801/03-etcdv2-result.log