bench-results/2016041801/06-consul-result.log
nohup: ignoring input

2016/04/19 04:40:31 Step 1: starting databases...
2016/04/19 04:40:31 [0] Start Consul at 10.240.0.7:3500
2016/04/19 04:40:31 [0] Response from 10.240.0.7:3500 (success:true )
2016/04/19 04:40:32 [1] Start Consul at 10.240.0.13:3500
2016/04/19 04:40:32 [1] Response from 10.240.0.13:3500 (success:true )
2016/04/19 04:40:33 [2] Start Consul at 10.240.0.14:3500
2016/04/19 04:40:33 [2] Response from 10.240.0.14:3500 (success:true )

2016/04/19 04:40:39 Step 2: starting tests...
 0 / 200000 B                        !   0.00%2016/04/19 04:40:39 finalize has started
 200000 / 200000 Booooooooooooooo! 100.00% 21s

Summary:
  Total:	21.9060 secs.
  Slowest:	0.2165 secs.
  Fastest:	0.0316 secs.
  Average:	0.1093 secs.
  Stddev:	0.0244 secs.
  Requests/sec:	9129.9167

Response time histogram:
  0.032 [1]	|
  0.050 [12]	|
  0.069 [409]	|
  0.087 [32324]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.106 [75093]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.124 [44964]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.143 [23809]	|∎∎∎∎∎∎∎∎∎∎∎∎
  0.161 [15415]	|∎∎∎∎∎∎∎∎
  0.180 [5989]	|∎∎∎
  0.198 [1331]	|
  0.217 [653]	|

Latency distribution:
  10% in 0.0821 secs.
  25% in 0.0921 secs.
  50% in 0.1035 secs.
  75% in 0.1218 secs.
  90% in 0.1467 secs.
  95% in 0.1591 secs.
  99% in 0.1795 secs.
unix_ts,avg_latency_ms,throughput
1461040839,104.854313,4714
1461040840,90.243022,11264
1461040841,96.644916,9992
1461040842,110.008647,9275
1461040843,118.798399,8254
1461040844,124.471485,7935
1461040845,126.187199,7837
1461040846,128.315248,8118
1461040847,112.247594,8493
1461040848,117.696030,8953
1461040849,117.845136,8391
1461040850,112.617550,8921
1461040851,120.267054,8295
1461040852,114.620082,8810
1461040853,99.097322,10163
1461040854,105.497102,9090
1461040855,100.460286,10304
1461040856,96.319345,10198
1461040857,111.442226,8885
1461040858,107.371406,9514
1461040859,105.719678,9501
1461040860,103.058306,9578
1461040861,103.311630,3515

2016/04/19 04:41:01 time series saved... Uploading to Google cloud storage...
2016/04/19 04:41:01 Uploading timeseries.csv to 2016041801/06-consul-timeseries.csv
UploadFile:

timeseries.csv
--->
2016041801/06-consul-timeseries.csv


UploadFile Done!

2016/04/19 04:41:02 Uploading result.log to 2016041801/06-consul-result.log
UploadFile:

result.log
--->
2016041801/06-consul-result.log